# Taps
tap "elastic/tap"
tap "homebrew/services"
tap "mongodb/brew"
tap "teamookla/speedtest"

# Developer Tools
brew "xz"
brew "webp"
brew "awscli"
brew "docker"
brew "flyctl"
brew "gh"
brew "git"
brew "httpie"
brew "libheif"
brew "mas"
brew "nvm"
brew "saml2aws"
brew "semgrep"
brew "wget"
brew "zlib"
brew "zsh"
brew "mongodb/brew/mongodb-database-tools"
brew "llm"
brew "antigen"
brew "iterm2"
cask "ngrok"
brew "node"
brew "pnpm"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python"
brew "poetry"
brew "uv"
brew "ruff"

# Services
brew "opensearch", restart_service: true
brew "ollama", restart_service: true
brew "mongodb-community", restart_service: true
brew "postgresql@14", restart_service: true
brew "rabbitmq", restart_service: true
brew "redis", restart_service: true
brew "elastic/tap/elasticsearch-full", restart_service: true
cask "clickhouse"

# Productivity
brew "teamookla/speedtest/speedtest"
cask "1password"
cask "cleanshot"
cask "cloudflare-warp"
cask "couleurs"
cask "docker"
cask "netnewswire"
cask "sf-symbols"
cask "slack"
cask "rectangle"
cask "tableplus"
cask "sketch"
cask "charles"
cask "doppler"
cask "font-0xproto-nerd-font"
cask "cursor"
cask "zoom"
cask "mimestream"
cask "chatgpt"
cask "ollamac"
cask "spotify"

# Mac App Store
mas '1Password for Safari', id: 1569813296
mas 'Xcode', id: 497799835
mas 'TestFlight', id: 899247664
mas 'JSON Peep for Safari', id: 1458969831
mas 'ia Writer', id: 775737590
mas 'Instapaper', id: 288545208
mas 'Infuse', id: 1136220934