tap "elastic/tap"
tap "homebrew/services"
tap "mongodb/brew"
tap "teamookla/speedtest"

brew "xz"
brew "webp"
brew "awscli"
brew "docker"
brew "flyctl"
brew "gh"
brew "git"
brew "httpie"
brew "libheif"
brew "mas"
brew "nvm"
brew "openjdk"
brew "saml2aws"
brew "semgrep"
brew "wget"
brew "zlib"
brew "zsh"
brew "teamookla/speedtest/speedtest"
brew "mongodb/brew/mongodb-database-tools"

# Services
brew "opensearch", restart_service: true
brew "ollama", restart_service: true
brew "mongodb-community@7.0"
brew "postgresql@14", restart_service: true
brew "rabbitmq", restart_service: true
brew "redis", restart_service: true
brew "elastic/tap/elasticsearch-full", restart_service: true

# JavaScript Tools
brew "node"
brew "pnpm"

# Python
brew "pyenv"
brew "pyenv-virtualenv"
brew "python"
brew "poetry"
brew "uv"
brew "ruff"

# Applications
cask "1password"
cask "arc"
cask "battle-net"
cask "chatgpt"
cask "cleanshot"
cask "cloudflare-warp"
cask "couleurs"
cask "cursor"
cask "discord"
cask "docker"
cask "mimestream"
cask "netnewswire"
cask "ngrok"
cask "reflect"
cask "selfcontrol"
cask "sf-symbols"
cask "signal"
cask "slack"
cask "rectangle"
cask "spotify"
cask "tableplus"
cask "sketch"
cask "screen-studio"

mas '1Password for Safari', id: 1569813296
mas 'Things', id: 904280696
mas 'Xcode', id: 497799835
mas 'Flow', id: 1423210932
mas 'TestFlight', id: 899247664
mas 'Pixelmator Pro', id: 1289583905
mas 'Save to Pocket', id: 1477385213
mas 'Userscripts', id: 1463298887
mas 'JSON Peep for Safari', id: 1458969831

# Editor Extensions
vscode "bierner.markdown-mermaid"
vscode "gimenete.github-linker"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "tamasfe.even-better-toml"
vscode "waderyan.gitblame"
vscode "wholroyd.jinja"
