# Taps
tap "teamookla/speedtest"

# Developer Tools
brew "xz"
brew "webp"
brew "awscli"
brew "flyctl"
brew "gh"
brew "git"
brew "httpie"
brew "libheif"
brew "mas"
brew "nvm"
brew "saml2aws"
brew "semgrep"
brew "wget"
brew "zlib"
brew "zsh"
brew "mongodb/brew/mongodb-database-tools"
brew "llm"
brew "antigen"
cask "iterm2"
cask "ngrok"
brew "node"
brew "pnpm"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python"
brew "poetry"
brew "uv"
cask "docker"
cask "timing"
brew "nvim"

# Services
brew "ollama", restart_service: true

# Productivity
brew "teamookla/speedtest/speedtest"
cask "cleanshot"
cask "cloudflare-warp"
cask "couleurs"
cask "docker"
cask "netnewswire"
cask "sf-symbols"
cask "slack"
cask "rectangle"
cask "tableplus"
cask "sketch"
cask "charles"
cask "doppler"
cask "font-0xproto-nerd-font"
cask "cursor"
# cask "zoom"
cask "chatgpt"
cask "ollamac"
cask "superwhisper"

# Mac App Store
mas 'JSON Peep for Safari', id: 1458969831
mas 'Instapaper', id: 288545208
mas 'Infuse', id: 1136220934
